/*******************************************************************************
 * @name    : 四元素姿态角算法头文件
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 将传感器的输出值进行姿态解算，得到目标载体的俯仰角和横滚角 和航向角
 * ----------------------------------------------------------------------------
 * @description
 * 将传感器的输出值进行姿态解算，得到目标载体的俯仰角和横滚角 和航向角
 * 
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/
#ifndef __IMU_H
#define __IMU_H

#include "stm32f10x.h"
#include "mpu6050.h"
#include <math.h>

#define M_PI  (float)3.1415926535

uint8_t IMU_init(void); //初始化
void IMU_getYawPitchRoll(float * ypr); //更新姿态
uint32_t micros(void);	//读取系统上电后的时间us 

#endif



